app/views/asistencias/index.html.erb

SELECT "fichas".* FROM "fichas" WHERE "fichas"."id" = ? LIMIT 1  [["id", 1]]
---

if Ficha.find_by_id(asistencia.ficha_id.to_i).nil? ;