app/views/asistencias/new.html.erb

	<% if current_user.cargo_id == 1 %>
		<%= f.input :ficha_id, :collection => Ficha.all(:order=>'nombre'),:label_method=> :nombre, :include_blank => 'Seleccione'%>
---
SELECT "fichas".* FROM "fichas" ORDER BY nombre