app/views/pagos/index.html.erb


    <%=
if Ficha.find_by_id(pago.ficha_id.to_i).nil? ;
---
SELECT "fichas".* FROM "fichas" WHERE "fichas"."id" = ? LIMIT 1  [["id", 1]]