app/views/pagos/new.html.erb

<% if current_user.cargo_id == 1 %>
	<%= f.input :ficha_id, :collection => Ficha.all(:order=>'nombre'), :selected => :nombre,:label_method=> :nombre%>
---
SELECT "fichas".* FROM "fichas" ORDER BY nombre


	<%= f.input :tipo_id, label: 'Tipo Pago', :collection => Tipo.all(:order=>'nombre'), :selected => :nombre,:label_method=> :nombre%>
---
SELECT "tipos".* FROM "tipos" ORDER BY nombre