app/views/examens/edit.html.erb

<%= simple_form_for @examen, :url => examen_path(@examen) , :method => 'put' do |f| %>
	<%= f.input :ficha_id, label: 'Nombre',:collection => Ficha.all(:order=>'nombre'),:label_method=> :nombre, :include_blank => 'Seleccione'%>
---
SELECT "fichas".* FROM "fichas" ORDER BY nombre