app/views/examens/index.html.erb


    <td><%=link_to Ficha.find_by_id(examen.ficha_id).nombre ,examen_path(examen)%></td>
---
SELECT "fichas".* FROM "fichas" WHERE "fichas"."id" = 1 LIMIT 1