app/views/examens/new.html.erb

SELECT "fichas".* FROM "fichas" ORDER BY nombre
---

	<%= f.input :ficha_id, :collection => Ficha.all(:order=>'nombre'), :selected => :nombre,:label_method=> :nombre%>