app/views/participacions/edit.html.erb


	<%= f.input :ficha_id, :collection => Ficha.all(:order=>'nombre'),:label_method=> :nombre, :include_blank => 'Seleccione'%>
	<%= f.input :evento_id, :collection => Evento.all(:order=>'nombre'),:label_method=> :nombre, :include_blank => 'Seleccione'%>
---
SELECT "fichas".* FROM "fichas" ORDER BY nombre
SELECT "eventos".* FROM "eventos" ORDER BY nombre