app/views/participacions/index.html.erb


	<td><%=link_to Ficha.find_by_id(participacion.ficha_id.to_i).nombre, participacion%></td>
    <td><%=link_to Evento.find_by_id(participacion.evento_id.to_i).nombre, participacion%></td>
---
SELECT "fichas".* FROM "fichas" WHERE "fichas"."id" = 1 LIMIT 1
SELECT "eventos".* FROM "eventos" WHERE "eventos"."id" = 1 LIMIT 1