app/views/fichas/edit.html.erb

SELECT "cargos".* FROM "cargos" ORDER BY nombre
---

	<div id="input"><%= f.input :cargo_id, label: 'Tipo de Usuario', :collection => Cargo.all(:order=>'nombre'),:label_method=> :nombre, :include_blank => 'Seleccione'%></div>

SELECT "actividads".* FROM "actividads" ORDER BY nombre
SELECT "locals".* FROM "locals" ORDER BY nombre
---

	<div id="input"><%= f.input :actividad_id, :collection => Actividad.all(:order=>'nombre'), :label_method=> :nombre, :include_blank => 'Seleccione'%></div>

    <div id="input"><%= f.input :local_id, label: 'Lugar de estudio/trabajo', :collection => Local.all(:order=>'nombre'),:label_method=> :nombre, :include_blank => 'Seleccione'%></div>