app/views/fichas/new.html.erb

	if current_user.cargo_id == 1 %>
	  <div id="input"><%= f.input :cargo_id, label: 'Tipo de Usuario', :collection => Cargo.all(:order=>'nombre'), :include_blank => 'Seleccione',:label_method=> :nombre%></div>
---
SELECT "cargos".* FROM "cargos" ORDER BY nombre


	<div id="input"><%= f.input :actividad_id, :collection => Actividad.all(:order=>'nombre'),  :include_blank => 'Seleccione',:label_method=> :nombre%></div>

    <div id="input"><%= f.input :local_id, label: 'Lugar de estudio/trabajo', :collection => Local.all(:order=>'nombre'), :include_blank => 'Seleccione',:label_method=> :nombre%></div>
---
SELECT "actividads".* FROM "actividads" ORDER BY nombre
SELECT "locals".* FROM "locals" ORDER BY nombre