app/views/fichas/show.html.erb

  <tr >
  <td ><%=  Evento.find_by_id(participacion.evento_id).nombre%></td>
---
SELECT "eventos".* FROM "eventos" WHERE "eventos"."id" = 1 LIMIT 1