app/controllers/actividads_controller.rb

  def index
    if current_user
          if current_user.cargo_id == 2
            redirect_to ficha_path (current_user)
          else
          end
          @actividads = Actividad.all
---
SELECT "actividads".* FROM "actividads"

  def show
    if current_user
          if current_user.cargo_id == 2
            redirect_to ficha_path (current_user)
          else
          end
           @actividad = Actividad.find(params[:id])
---
SELECT "actividads".* FROM "actividads" WHERE "actividads"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    if current_user
    @actividad = Actividad.new(params[:actividad])

    if @actividad.save
---
INSERT INTO "actividads" ("created_at", "descripcion", "nombre", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 02 Jun 2014 23:55:30 UTC +00:00], ["descripcion", ""], ["nombre", "Estudiantes"], ["updated_at", Mon, 02 Jun 2014 23:55:30 UTC +00:00]]

  def edit
    if current_user
          if current_user.cargo_id == 2
            redirect_to ficha_path (current_user)
          else
          end

          @actividad = Actividad.find(params[:id])
---
SELECT "actividads".* FROM "actividads" WHERE "actividads"."id" = ? LIMIT 1  [["id", "1"]]

  def destroy
    if current_user
    @actividad = Actividad.find(params[:id])
    @actividad.destroy
---
SELECT "actividads".* FROM "actividads" WHERE "actividads"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "actividads" WHERE "actividads"."id" = ?  [["id", 3]]