app/controllers/asistencias_controller.rb

SELECT "asistencia".* FROM "asistencia" ORDER BY fecha asc LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "asistencia"
---
  def index
    if current_user
      if current_user.cargo_id == 2
        redirect_to asistencia_path (current_user)
      else
      end
    @asistencias = Asistencia.search(params[:search]).order(sort_column + ' ' + sort_direction).paginate(:per_page => 5, :page => params[:page])

SELECT "asistencia".* FROM "asistencia" WHERE "asistencia"."ficha_id" = 1 ORDER BY fecha DESC
SELECT "fichas".* FROM "fichas" WHERE "fichas"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    if current_user
      if current_user.cargo_id == 2
        @asistencias = Asistencia.where(ficha_id: current_user)
        @ficha = Ficha.find(current_user)

INSERT INTO "asistencia" ("created_at", "fecha", "ficha_id", "horas", "mes_ano", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    if current_user
    @nueva_asistencia = Asistencia.new(params[:asistencia])


    @nueva_asistencia.mes_ano= Date.new(
      params['asistencia']["fecha(1i)"].to_i,
      params['asistencia']["fecha(2i)"].to_i,
      1)
          if current_user.cargo_id == 2
            @nueva_asistencia.ficha_id=current_user.id
          else
          end

          if @nueva_asistencia.save

SELECT "asistencia".* FROM "asistencia" WHERE "asistencia"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    if current_user
    @asistencia = Asistencia.find(params[:id])

SELECT "asistencia".* FROM "asistencia" WHERE "asistencia"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "asistencia" WHERE "asistencia"."id" = ?  [["id", 2]]
---
  def destroy
    if current_user
    @asistencia = Asistencia.find(params[:id])
    @asistencia.destroy