app/controllers/cargos_controller.rb

  def index
        if current_user
          if current_user.cargo_id == 2
            redirect_to ficha_path (current_user)
          else
          end

    @cargos = Cargo.all
---
SELECT "cargos".* FROM "cargos"

  def create
        if current_user
    @cargo = Cargo.new(params[:cargo])

    if @cargo.save
---
INSERT INTO "cargos" ("created_at", "descripcion", "nombre", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 03 Jun 2014 00:01:07 UTC +00:00], ["descripcion", ""], ["nombre", "Administrador"], ["updated_at", Tue, 03 Jun 2014 00:01:07 UTC +00:00]]