app/controllers/eventos_controller.rb

INSERT INTO "eventos" ("created_at", "descripcion", "fecha", "nombre", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 09 Jun 2014 22:04:43 UTC +00:00], ["descripcion", ""], ["fecha", Mon, 09 Jun 2014], ["nombre", "Torneo"], ["updated_at", Mon, 09 Jun 2014 22:04:43 UTC +00:00]]
---
  def create
    @evento = Evento.new(params[:evento])

    if @evento.save

SELECT "eventos".* FROM "eventos" WHERE "eventos"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "eventos" WHERE "eventos"."id" = ?  [["id", 2]]
---
  def destroy
    @evento = Evento.find(params[:id])
    @evento.destroy