app/controllers/examens_controller.rb

SELECT "examen".* FROM "examen"
---
  def index
    @examens = Examen.all

SELECT "examen".* FROM "examen" WHERE "examen"."ficha_id" = 1 ORDER BY fecha DESC
SELECT "fichas".* FROM "fichas" WHERE "fichas"."id" = 1 LIMIT 1
SELECT "examen".* FROM "examen" WHERE "examen"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    if current_user
      if current_user.cargo_id == 2
        @examens = Examen.where(ficha_id: current_user)
        @ficha = Ficha.find(current_user)
      else
        @examens = Examen.where(ficha_id: params[:id])
        @ficha = Ficha.find(params[:id])
      end
    @examens = @examens.all(:order => "fecha DESC")

INSERT INTO "examen" ("created_at", "detalle", "fecha", "ficha_id", "pagado", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Mon, 09 Jun 2014 22:04:59 UTC +00:00], ["detalle", ""], ["fecha", Mon, 09 Jun 2014], ["ficha_id", 1], ["pagado", "No"], ["updated_at", Mon, 09 Jun 2014 22:04:59 UTC +00:00]]
---
  def create
    @examen = Examen.new(params[:examen])






    if @examen.save

SELECT "examen".* FROM "examen" WHERE "examen"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @examen = Examen.find(params[:id])

SELECT "examen".* FROM "examen" WHERE "examen"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "examen" WHERE "examen"."id" = ?  [["id", 2]]
---
  def destroy
    @examen = Examen.find(params[:id])
    @examen.destroy