app/controllers/fichas_controller.rb

  def index

    if current_user
      if current_user.cargo_id == 2
          redirect_to ficha_path (current_user)
        else
          @fichas = Ficha.search(params[:search]).order(sort_column + ' ' + sort_direction).paginate(:per_page => 5, :page => params[:page])
---
SELECT "fichas".* FROM "fichas" ORDER BY nombre desc LIMIT 5 OFFSET 0

  def show
    if current_user
      if current_user.cargo_id == 2
        @ficha = Ficha.find(current_user)
      else
        @ficha = Ficha.find(params[:id])
      end

        @asistencias = Asistencia.where(ficha_id: @ficha.id)
        @pagos = Pago.where(ficha_id: @ficha.id)
        @participacionParcial = Participacion.where(ficha_id: @ficha.id)
        @examenParcial = Examen.where(ficha_id: @ficha.id)

        @local = Local.find_by_id(@ficha.local_id.to_i)
        @tipo = Tipo.find_by_id(@ficha.tipo_id.to_i)
        @cargo = Cargo.find_by_id(@ficha.cargo_id.to_i)
        @lugar = Lugar.find_by_id(@ficha.lugar_id.to_i)
        @actividad = Actividad.find_by_id(@ficha.actividad_id.to_i)
        @asistenciaParcial= @asistencias.select("date(mes_ano) as ordered_fecha, sum(horas) as total_horas").group("date(mes_ano)")
        @asistenciaParcial=@asistenciaParcial.where(mes_ano: (Time.now - 1.year)..Time.now)

        @pagoParcial= @pagos.select("date(mes_ano) as ordered_fecha, sum(valor) as total_horas").group("date(mes_ano)")
        @pagoParcial=@pagoParcial.where(mes_ano: (Time.now - 1.year)..Time.now)

        @participacionParcial=@participacionParcial.where(fecha: (Time.now - 1.year)..Time.now)
        @examenParcial=@examenParcial.where(fecha: (Time.now - 1.year)..Time.now)
---
SELECT "fichas".* FROM "fichas" WHERE "fichas"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "locals".* FROM "locals" WHERE "locals"."id" = 1 LIMIT 1
SELECT "tipos".* FROM "tipos" WHERE "tipos"."id" = 0 LIMIT 1
SELECT "cargos".* FROM "cargos" WHERE "cargos"."id" = 1 LIMIT 1
SELECT "lugars".* FROM "lugars" WHERE "lugars"."id" = 0 LIMIT 1
SELECT "actividads".* FROM "actividads" WHERE "actividads"."id" = 1 LIMIT 1
SELECT SUM("asistencia"."horas") AS sum_id FROM "asistencia" WHERE "asistencia"."ficha_id" = 1
SELECT datetime(mes_ano) as ordered_fecha, sum(horas) as total_horas FROM "asistencia" WHERE "asistencia"."ficha_id" = 1 AND ("asistencia"."mes_ano" BETWEEN '2013-06-03 18:29:36.977052' AND '2014-06-03 18:29:36.977052') GROUP BY date(mes_ano)
SELECT SUM("pagos"."valor") AS sum_id FROM "pagos" WHERE "pagos"."ficha_id" = 1
SELECT datetime(mes_ano) as ordered_fecha, sum(valor) as total_horas FROM "pagos" WHERE "pagos"."ficha_id" = 1 AND ("pagos"."mes_ano" BETWEEN '2013-06-03 18:29:36.977052' AND '2014-06-03 18:29:36.977052') GROUP BY date(mes_ano)
SELECT "participacions".* FROM "participacions" WHERE "participacions"."ficha_id" = 1 AND ("participacions"."fecha" BETWEEN '2013-06-10 00:45:19.406296' AND '2014-06-10 00:45:19.406296')
SELECT "examen".* FROM "examen" WHERE "examen"."ficha_id" = 1 AND ("examen"."fecha" BETWEEN '2013-06-10 00:57:49.861219' AND '2014-06-10 00:57:49.861219')

  def create
        @ficha = Ficha.new(params[:ficha])
        if current_user
          @ficha.cargo_id=2
        else
        end
        if @ficha.save
---
INSERT INTO "fichas" ("actividad_id", "cargo_id", "created_at", "email", "fechanacimiento", "fono", "local_id", "lugar_id", "nombre", "password", "password_confirmation", "password_digest", "password_hash", "password_salt", "photo_content_type", "photo_file_name", "photo_file_size", "photo_updated_at", "rut", "tipo_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    if current_user
    @ficha = Ficha.find(params[:id])
---
SELECT "fichas".* FROM "fichas" WHERE "fichas"."id" = ? LIMIT 1  [["id", "1"]]

  def update
    if current_user
    @ficha = Ficha.find(params[:id])

  if @ficha.update_attributes(params[:ficha])
---
SELECT "fichas".* FROM "fichas" WHERE "fichas"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "fichas" SET "photo_file_name" = '6746-4_1_.jpg', "photo_content_type" = 'image/jpeg', "photo_file_size" = 148206, "photo_updated_at" = '2014-06-03 00:23:13.666259', "updated_at" = '2014-06-03 00:23:13.691260' WHERE "fichas"."id" = 1

  def destroy
    @ficha = Ficha.find(params[:id])

    if @ficha.id ==current_user.id
      session[:ficha_id] = nil
    else
  end




    @ficha.destroy
---
SELECT "fichas".* FROM "fichas" WHERE "fichas"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "fichas" WHERE "fichas"."id" = ?  [["id", 2]]