app/controllers/locals_controller.rb

  def index
    if current_user
          if current_user.cargo_id == 2
            redirect_to ficha_path (current_user)
          else
          end
          @locals = Local.all
---
SELECT "locals".* FROM "locals"

  def create
    if current_user
    @local = Local.new(params[:local])

    if @local.save
---
INSERT INTO "locals" ("created_at", "fono", "nombre", "ubicacion", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 03 Jun 2014 00:20:21 UTC +00:00], ["fono", ""], ["nombre", "Chiguayante"], ["ubicacion", ""], ["updated_at", Tue, 03 Jun 2014 00:20:21 UTC +00:00]]