app/controllers/lugars_controller.rb

SELECT "lugars".* FROM "lugars"
---
  def index
    @lugars = Lugar.all

INSERT INTO "lugars" ("created_at", "nombre", "ubicacion", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 03 Jun 2014 00:18:19 UTC +00:00], ["nombre", "Universidad Del Bio Bio"], ["ubicacion", ""], ["updated_at", Tue, 03 Jun 2014 00:18:19 UTC +00:00]]
---
  def create
    @lugar = Lugar.new(params[:lugar])

    if @lugar.save

SELECT "lugars".* FROM "lugars" WHERE "lugars"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "lugars" WHERE "lugars"."id" = ?  [["id", 2]]
---
  def destroy
    @lugar = Lugar.find(params[:id])
    @lugar.destroy