app/controllers/pagos_controller.rb

  def index

    if current_user
      if current_user.cargo_id == 2
        redirect_to pago_path (current_user)
      else
      end

    @pagos = Pago.search(params[:search]).order(sort_column + ' ' + sort_direction).paginate(:per_page => 5, :page => params[:page])
---
SELECT "pagos".* FROM "pagos" ORDER BY ficha_id asc LIMIT 5 OFFSET 0

  def show

    if current_user
      @pagos = Pago.search(params[:search]).order(sort_column + ' ' + sort_direction).paginate(:per_page => 5, :page => params[:page])

      if current_user.cargo_id == 2
        @pagos = @pagos.where(ficha_id: current_user)
        @ficha = Ficha.find(current_user)
---
SELECT "pagos".* FROM "pagos" WHERE "pagos"."ficha_id" = 1 ORDER BY fecha asc LIMIT 5 OFFSET 0
SELECT "fichas".* FROM "fichas" WHERE "fichas"."id" = ? LIMIT 1  [["id", 1]]

  def create
    if current_user
    @nueva_pago = Pago.new(params[:pago])


    @nueva_pago.mes_ano= Date.new(
      params['pago']["fecha(1i)"].to_i,
      params['pago']["fecha(2i)"].to_i,
      1)

    /@pago.fecha= Time.new(
      params['pago']["fecha(1i)"].to_i,
      params['pago']["fecha(2i)"].to_i,
      params['pago']["fecha(3i)"].to_i)/


      if current_user.cargo_id == 2
        @nueva_pago.ficha_id=current_user.id
      else
      end


    if @nueva_pago.save
---
INSERT INTO "pagos" ("created_at", "detalle", "fecha", "ficha_id", "mes_ano", "recibo_content_type", "recibo_file_name", "recibo_file_size", "recibo_updated_at", "tipo_id", "updated_at", "valor") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    if current_user
    @pago = Pago.find(params[:id])
---
SELECT "pagos".* FROM "pagos" WHERE "pagos"."id" = ? LIMIT 1  [["id", "1"]]

  def update
    if current_user
    @pago = Pago.find(params[:id])

    @pago.mes_ano= Date.new(
      params['pago']["fecha(1i)"].to_i,
      params['pago']["fecha(2i)"].to_i,
      1)
  if @pago.update_attributes(params[:pago])
---
SELECT "pagos".* FROM "pagos" WHERE "pagos"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "pagos" SET "mes_ano" = '2012-06-01', "fecha" = '2012-06-09', "updated_at" = '2014-06-10 01:49:02.718977' WHERE "pagos"."id" = 1