app/controllers/sessions_controller.rb

SELECT "fichas".* FROM "fichas" WHERE "fichas"."id" = 1 LIMIT 1
---
def create
  ficha = Ficha.authenticate(params[:email], params[:password])
  if ficha
    session[:ficha_id] =  Ficha.find_by_id(ficha.id)